fbiego/esp32-c3-mini/hal/esp32/app_hal.cpp
    uint8_t id2 = item[1];

    bool isG = (item[1] & 0x80) == 0x80;

    if (id == 0x08)
    {
      isG = true;
    }

    uint8_t cmp = isG ? (item[1] & 0x7F) : 1;

    int aOff = item[2];

    bool isM = (item[3] & 0x80) == 0x80;
    uint8_t cG = isM ? (item[3] & 0x7F) : 1;

    if (!isKnown(id))
    {
      continue;
    }

    if (id == 0x16 && (item[1] == 0x06 || item[1] == 0x00))
    {
      // weather (-) label
      continue;
    }
    if (isM)
    {
      lan++;
    }

    if (tp == 0x09 && id == 0x09)
    {
      a++;
    }
    else if (tp != id)
    {
      tp = id;
      a++;
    }
    else if (lan == 1)
    {
      a++;
    }

    if (xSz == 0 || ySz == 0)
    {
      continue;
    }

    int z = i;
    int rs = -1;

    bool createFile = false;

    if (rsc.containsKey(String(clt)))
    {
      z = rsc[String(clt)].as<int>();
      rs = z;
    }

    bool drawable = (id == 0x0d) ? (lan == 1 || lan == 17 || lan == 33) : true;

    JsonDocument grp;
    JsonArray grpArr = grp.to<JsonArray>();

    if (rs == -1 && drawable)
    {
      rsc[String(clt)] = i;

      for (int aa = 0; aa < cmp; aa++)
      {
        unsigned long nm = (i * 10000) + (clt * 10) + aa;
        grpArr.add("S:" + name + "_" + longHexString(nm) + ".bin");
      }

      if (id == 0x17)
      {
      }
      else if (id == 0x0A)
      {
      }
      else if (cmp == 1)
      {
      }
      else
      {
      }

      // save asset
      createFile = true;
    }
    else if (id == 0x16 && id2 == 0x00)
    {
      // save asset
      createFile = true;

      for (int aa = 0; aa < cmp; aa++)
      {
        unsigned long nm = (z * 10000) + (clt * 10) + aa;
        grpArr.add("S:" + name + "_" + longHexString(nm) + ".bin");
      }
    }
    else
    {

      for (int aa = 0; aa < cmp; aa++)
      {
        unsigned long nm = (z * 10000) + (clt * 10) + aa;
        grpArr.add("S:" + name + "_" + longHexString(nm) + ".bin");
      }
    }

    if (cmp <= 1)
    {
      // grp is null
      grpArr.clear();
    }

    if (id == 0x0A)
    {
      // if (connIC.count { it == '\n' } < 3) {
      //     continue
      // }
    }

    if (isM)
    {
      if (lan == cG)
      {
        lan = 0;
      }
      else if (id == 0x0d && (lan == 1 || lan == 32 || lan == 40 || lan == 17 || lan == 33))
      {
        yOff -= (ySz - aOff);
        xOff -= aOff;
      }
      else
      {
        continue;
      }
    }
    if (id == 0x17)
    {
      wt++;
      if (wt != 1)
      {
        continue;
      }
    }

    if (id == 0x16 && id2 == 0x06)
    {
      continue;
    }

    if (drawable)
    {
      element["pvX"] = aOff;
      element["pvY"] = ySz - aOff;

      unsigned long nm = (z * 10000) + (clt * 10) + 0;

      element["image"] = "S:" + name + "_" + longHexString(nm) + ".bin";
      element["group"] = grpArr;

      elArray.add(element);
    }

    Serial.printf("i:%d, id:%d, xOff:%d, yOff:%d, xSz:%d, ySz:%d, clt:%d, dat:%d, cmp:%d\n", i, id, xOff, yOff, xSz, ySz, clt, dat, cmp);

    if (!createFile)
    {
      continue;
    }
    uint8_t cf = (id == 0x09 && i == 0) || (id == 0x19) ? 0x04 : 0x05;
    bool tr = cf == 0x05;

    for (int b = 0; b < cmp; b++)
    {
      unsigned long nm = (z * 10000) + (clt * 10) + b;

      String asset = "/" + name + "_" + longHexString(nm) + ".bin";
      Serial.print("Create asset-> ");
      Serial.print(asset);

      assetArray.add(asset);

      uint8_t header[4];

      lvImgHeader(header, cf, xSz, ySz / cmp);

      Serial.print("\t");
      Serial.println(hexString(header, 4));

      File ast = FLASH.open(asset.c_str(), FILE_WRITE);
      if (ast)
      {
        ast.write(header, 4);

        if (!readDialBytes(path, table, clt, 512))
        {
          Serial.println("Could not read color table bytes from file");
          errors++;
          break;
        }

        uint16_t yZ = uint16_t(ySz / cmp); // height of individual element

        File file = FLASH.open(path, "r");
        if (!file)
        {
          Serial.println("Failed to open file for reading");
          errors++;
          break;
        }
        int offset = (xSz * yZ) * b;

        if (!file.seek(dat + offset))
        {
          Serial.println("Failed to seek file");
          file.close();
          errors++;
          break;
        }

        int x = 0;
        if (id == 0x19)
        {
          for (int z = 0; z < (xSz * yZ); z++)
          {
            uint8_t pixel[2];
            pixel[0] = item[13];
            pixel[1] = item[12];
            ast.write(pixel, 2);
          }
        }
        else
        {
          while (file.available())
          {
            uint16_t index = file.read();

            uint8_t pixel[3];
            if (tr)
            {
              pixel[0] = table[(index * 2) + 1];
              pixel[1] = table[index * 2];
              pixel[2] = (uint16_t(pixel[0] * 256 + pixel[1]) == 0) ? 0x00 : 0xFF; // alpha byte (black pixel [0] is transparent)
              ast.write(pixel, 3);
            }
            else
            {
              pixel[0] = table[(index * 2) + 1];
              pixel[1] = table[index * 2];

              ast.write(pixel, 2);
            }
            x++;
            if (x >= (xSz * yZ))
            {
              break;
            }
          }
        }
        file.close();

        ast.close();
      }
      else
      {
        errors++;
      }
    }
  }

  json["elements"] = elements;
  json["assets"] = assetFiles;

  // serializeJsonPretty(json, Serial);

  String jsnFile = "/" + name + ".jsn";
  assetArray.add(jsnFile);
  File jsn = FLASH.open(jsnFile, FILE_WRITE);

  if (jsn)
  {
    serializeJsonPretty(json, jsn);
    jsn.flush();
    jsn.close();
  }
  else
  {
    errors++;
  }

  if (errors > 0)
  {
    // failed to parse watchface files
    // probably delete assetfiles
    Serial.print(errors);
    Serial.println(" errors encountered when parsing watchface");
    tft.fillScreen(TFT_RED);
    tft.setTextColor(TFT_WHITE, TFT_RED);
    tft.setTextSize(2);
    tft.setCursor(80, 80);
    tft.print("Failed");
  }
  else
  {
    // success
    // probably delete source file

    tft.fillScreen(TFT_GREEN);
    tft.setTextColor(TFT_WHITE, TFT_GREEN);
    tft.setTextSize(2);
    tft.setCursor(80, 80);
    tft.print("Success");

    deleteFile(path);
    Serial.println("Watchface parsed successfully");

    prefs.putString("custom", jsnFile);
  }
  delay(500);
  ESP.restart();

#endif
}

bool lvImgHeader(uint8_t *byteArray, uint8_t cf, uint16_t w, uint16_t h)
{
  // Ensure the input values fit within the specified bit field sizes
  if (cf >= (1 << 5) || w >= (1 << 11) || h >= (1 << 11))
  {
    // Invalid input values
    return false;
  }

  uint32_t header = (cf & 0x1F) | (0 << 5) | (0 << 8) | ((w & 0x07FF) << 10) | ((h & 0x07FF) << 21);

  // Convert the 32-bit integer to bytes in little-endian format
  byteArray[0] = header & 0xFF;
  byteArray[1] = (header >> 8) & 0xFF;
  byteArray[2] = (header >> 16) & 0xFF;
  byteArray[3] = (header >> 24) & 0xFF;

  return true;
}
